JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2019 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */
#include "lora_sx1276.h"
#include "stdlib.h"	// for malloc
#define ESP32SENTENCE 1500
#define HC12SENTENCE 255	// sentence max length = 140

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;
SPI_HandleTypeDef hspi3;
SPI_HandleTypeDef hspi4;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart7;
UART_HandleTypeDef huart8;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

uint8_t hcRxChar[2];	// handed character from HC-12
uint8_t hcSentence[HC12SENTENCE];
uint16_t hcSentenceLength = 0;
uint8_t hcSentenceProcessing = 0;
uint8_t hcSentenceReady = 0;//1 = sentence ready to process, 0 = sentence not ready

uint8_t timer = 0;


//WiFi - Esp32
uint8_t esp32RxChar[2];
uint8_t Esp32_Sentence[ESP32SENTENCE];
int Esp32_Sentence_length = 0;
uint8_t esp32SentenceReady = 0;

// LoRa
lora_sx1276 lora;
lora_sx1276 lora2;
uint8_t buffer[32];
uint8_t error = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI2_Init(void);
static void MX_SPI3_Init(void);
static void MX_SPI4_Init(void);
static void MX_UART7_Init(void);
static void MX_UART8_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

void handleResp(uint8_t res) {
	switch (res) {
	case LORA_OK:
		vypis("[LoRa] OK\r\n");
		break;
	case LORA_CRC_ERROR:
		vypis("[LoRa] CRC Error\r\n");
		break;
	case LORA_TIMEOUT:
		vypis("[LoRa] Timeout\r\n");
		break;
	case LORA_INVALID_HEADER:
		vypis("[LoRa] Invalid header\r\n");
		break;
	case LORA_ERROR:
		vypis("[LoRa] Error\r\n");
		break;
	case LORA_BUSY:
		vypis("[LoRa] Busy\r\n");
		break;
	case LORA_EMPTY:
		vypis("[LoRa] Empty\r\n");
		break;
	default:
		vypis("[LoRa] Unknown response: " + res);
		break;
	}

}

char * addToMsg(char dst[], const char src[]) {
	int sizeNewArray = strlen(dst) + strlen(src) + 1;
	char * newJSON = (char *) malloc(sizeNewArray);
	strcpy(newJSON, dst);
	strcpy(newJSON + strlen(dst), src);
	free(dst);	// free old memory
	return newJSON;
}

uint16_t getCharCount(uint8_t *msg, uint8_t *msg_len, uint8_t ch) {
	int count = 0;
	for (int i = 0; i < *msg_len; i++) {
		if (*(msg + i) == ch) {
			count++;
		}
	}
	return count;
}

uint8_t * removeDoubles(uint8_t *msg, uint16_t *msg_len) {
	uint16_t specCharCount = getCharCount(msg, msg_len, 0xfe)
			+ getCharCount(msg, msg_len, 0xff);
	uint16_t new_msg_size = (*msg_len) - 6 - ((specCharCount - 2) / 2);	// old size - 2 border chars - doubled
	uint8_t * new_msg = (uint8_t *) malloc(new_msg_size);
	uint16_t newIndex = 0;
	uint16_t oldIndex = 0;
	if ((*(msg) == 0x00) && (*(msg + 1) == 0xfe) && (*(msg + 2) == 0x00)) {
		oldIndex = 3;
		while (oldIndex < (*msg_len) - 3) {
			if ((*(msg + oldIndex) == 0xff)
					&& (*(msg + oldIndex + 1) == 0xff)) {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex += 2;
			} else if ((*(msg + oldIndex) == 0xfe)
					&& (*(msg + oldIndex + 1) == 0xfe)) {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex += 2;
			} else {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex++;
			}
		}
	} else {
		return msg;
	}

