JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2/Src/main.c
	*msg_len = new_msg_size;
	return new_msg;
}

char* parseMessage(uint8_t *msg, uint16_t *msg_len) {
	hcSentenceProcessing = 1;

	uint16_t oldSize = *msg_len;
	msg = removeDoubles(msg, msg_len);
	if (oldSize == *msg_len) {
		HAL_UART_Transmit(&huart2, (uint8_t*) "{\"Id\":-1}\r\n", 11, 10);
		hcSentenceProcessing = 0;
		return;
	}
	uint16_t index = 2;	// first 2 bytes are packet ID
	uint16_t ramecID = ((uint16_t) *(msg + 1) << 8) | *(msg);	// packet ID

	char buff[260];	// buffer for internal JSON - { } - appended tu main JSON - [ { \"%d\":[ -
	char* JSON = malloc(sizeof(char));// final JSON to be printed to monitoring station
	JSON[0] = 0;
	uint16_t JSON_len = 0;		// count of sub data { }

	// start main JSON with [ { \"%d\":[
	char buffer[13];
	sprintf(buffer, "{\"Id\":%d,\"Data\":{", ramecID); // new [{\"Id\":%d,\"Data\":[ 		old: [{\"%d\":[
	JSON = addToMsg(JSON, buffer);
	uint8_t switchError = 0; // error if key is out of CAN ID values / BAD PARSING

	while ((index < *msg_len) && (switchError == 0)) {
		uint16_t key = ((uint16_t) *(msg + index + 1) << 8) | *(msg + index);
		index++;
		switch (key) {
		case 5:
			// GPS data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"GPS_data\":{\"latitude\":%u,\"latitude_char\":\"%c\",\"longitude\":%u,\"longitude_char\":\"%c\",\"speed\":%u,\"course\":%u,\"altitude\":%ld}",
					(uint32_t) (*(msg + index + 1) << 24)
							| (uint32_t) (*(msg + index + 2) << 16)
							| (uint32_t) (*(msg + index + 3) << 8)
							| (uint32_t) (*(msg + index + 4)),
					*(msg + index + 5),
					(uint32_t) (*(msg + index + 6) << 24)
							| (uint32_t) (*(msg + index + 7) << 16)
							| (uint32_t) (*(msg + index + 8) << 8)
							| (uint32_t) (*(msg + index + 9)),
					*(msg + index + 10),
					(uint32_t) (*(msg + index + 11) << 24)
							| (uint32_t) (*(msg + index + 12) << 16)
							| (uint32_t) (*(msg + index + 13) << 8)
							| (uint32_t) (*(msg + index + 15)),
					(uint32_t) (*(msg + index + 15) << 24)
							| (uint32_t) (*(msg + index + 16) << 16)
							| (uint32_t) (*(msg + index + 17) << 8)
							| (uint32_t) (*(msg + index + 18)),
					(int32_t) (*(msg + index + 19) << 24)
							| (int32_t) (*(msg + index + 20) << 16)
							| (int32_t) (*(msg + index + 21) << 8)
							| (int32_t) (*(msg + index + 22)));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 23;
			break;
		case 10:
			// BBOX_power_data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BBOX_power\":{\"power\":%d,\"current\":%d,\"voltage\":%d}",
					((int16_t) *(msg + index + 2) << 8) | *(msg + index + 1),
					((int16_t) *(msg + index + 4) << 8) | *(msg + index + 3),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 7;
			break;
		case 15:
			// wheel RPM
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"wheel_RPM\":{\"front_right\":%d,\"front_left\":%d,\"rear_right\":%d,\"rear_left\":%d}",
					((uint16_t) *(msg + index + 2) << 8) | *(msg + index + 1),
					((uint16_t) *(msg + index + 4) << 8) | *(msg + index + 3),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5),
					((uint16_t) *(msg + index + 8) << 8) | *(msg + index + 7));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 20:
			// BBOX status data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BBOX_status\":{\"SHD_IN\":%d,\"SHD_OUT\":%d,\"TSMS\":%d,\"AIR_N\":%d,\"AIR_P\":%d,\"PRECH_60V\":%d,\"IMD_OK\":%d,\"BMS_OK\":%d,\"SIGNAL_ERROR\":%d,\"SHD_RESET\":%d,\"SHD_EN\":%d,\"POLARITY\":%d,\"FANS\":%d,\"STM_temp\":%d}",
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 2) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 1) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 1) & 0b00000010) >> 1,
					(uint8_t) (*(msg + index + 1) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 1) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 2) & 0b00010000) >> 4,
					(uint8_t) (*(msg + index + 2) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 1) & 0b00000001) >> 0,
					(uint8_t) (*(msg + index + 1) & 0b00000100) >> 2,
					(uint8_t) (*(msg + index + 1) & 0b00010000) >> 4,
					(int8_t) *(msg + index + 3));
			JSON = addToMsg(JSON, buff);
			JSON_len++;

			index = index + 4;
			break;
		case 25:
			// FU_Values_1
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"FU_Values_1\":{\"apps1\":%d,\"apps2\":%d,\"brake1\":%d,\"brake2\":%d,\"error\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5)

					);
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 7;
			break;
		case 30:
			// BBOX_command
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff, "\"BBOX_command\":{\"FANS\":%d,\"SHD_EN\":%d}",
					(uint8_t) (*(msg + index + 1) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b01000000) >> 6);
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 2;
			break;
		case 40:
			// BMS_Command
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Command\":{\"BMS_Balanc\":%d,\"BMS_FullMode\":%d,\"BMS_OK\":%d,\"BMS_ONOFF\":%d,\"BMS_CAN\":%d}",
					(uint8_t) (*(msg + index + 1) & 0b11000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b00110000) >> 4,
					(uint8_t) (*(msg + index + 1) & 0b00001100) >> 2,
					(uint8_t) (*(msg + index + 1) & 0b00000011));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 3;
			break;
		case 50:
			// BMS_State
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_State\":{\"BMS_Mode\":%d,\"BMS_Faults\":%d,\"CellVolt_L\":%d,\"CellVolt_H\":%d,\"CellTemp_L\":%d,\"CellTemp_H\":%d,\"BMS_Ident\":%d}",
					(uint8_t) *(msg + index + 1),
					((uint16_t) *(msg + index + 3) << 8) | *(msg + index + 2),
					(uint8_t) *(msg + index + 4), (uint8_t) *(msg + index + 5),
					(uint8_t) *(msg + index + 6), (uint8_t) *(msg + index + 7),
					(uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 60:
			// ECU_State
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"ECU_State\":{\"ECU_Status\":%d,\"FL_AMK_Status\":%d,\"FR_AMK_Status\":%d,\"RL_AMK_Status\":%d,\"RR_AMK_Status\":%d,\"TempMotor_H\":%d,\"TempInverter_H\":%d,\"TempIGBT_H\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 70:
			// FU_Values_2
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"FU_Values_2\":{\"steer\":%d,\"susp_FL\":%d,\"susp_FR\":%d,\"brake_pos\":%d,\"RTD\":%d,\"BOTS\":%d,\"SHDB\":%d,\"INERTIA_SW\":%d,\"reserve\":%d}",
					(int8_t) *(msg + index + 1),
					((uint16_t) *(msg + index + 3) << 8) | *(msg + index + 2),
					((uint16_t) *(msg + index + 5) << 8) | *(msg + index + 4),
					(uint8_t) *(msg + index + 6),
					(uint8_t) (*(msg + index + 7) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 7) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 7) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 7) & 0b00010000) >> 4,
					(uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 80:
			// Interconnect
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"Interconnect\":{\"car_state\":%d,\"left_w_pump\":%d,\"right_w_pump\":%d,\"brake_red\":%d,\"brake_white\":%d,\"tsas\":%d,\"killswitch_R\":%d,\"killswitch_L\":%d,\"reserve\":%d,\"susp_RR\":%d,\"susp_RL\":%d}",
					(uint8_t) *(msg + index + 1),
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 2) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 2) & 0b00010000) >> 4,
					(uint8_t) (*(msg + index + 2) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 2) & 0b00000100) >> 2,
					(uint8_t) (*(msg + index + 2) & 0b00000010) >> 1,
					(uint8_t) *(msg + index + 3),
					((uint16_t) *(msg + index + 5) << 8) | *(msg + index + 4),
					((uint16_t) *(msg + index + 7) << 8) | *(msg + index + 6));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 8;
			break;
		case 90:
			// BMS_Voltages
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Voltages\":{\"BMS_VoltIdent\":%d,\"BMS_Volt1\":%d,\"BMS_Volt2\":%d,\"BMS_Volt3\":%d,\"BMS_Volt4\":%d,\"BMS_Volt5\":%d,\"BMS_Volt6\":%d,\"BMS_Volt7\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 95:
			// BMS_Voltages
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Temps\":{\"BMS_TempIdent\":%d,\"BMS_Temp1\":%d,\"BMS_Temp2\":%d,\"BMS_Temp3\":%d,\"BMS_Temp4\":%d,\"BMS_Temp5\":%d,\"BMS_Temp6\":%d,\"BMS_Temp7\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		default:
			// unknown CAN ID
			switchError = 1;
		}
	}
	hcSentenceProcessing = 0;	// done with processing HC-12 sentence
	JSON = addToMsg(JSON, "}}\r\n");	// append last chars to final JSON
	
	HAL_UART_Transmit(&huart2, (uint8_t*) JSON, strlen(JSON), 200);
	free(JSON);
}

