JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2/Src/main.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	HAL_GPIO_TogglePin(LED4_GPIO_Port, LED4_Pin);
	if (huart == &huart8) {
		if (hcSentenceProcessing) {
		} else if ((hcSentenceLength >= 2) && (hcRxChar[0] == '\0')
				&& (hcSentence[hcSentenceLength - 2] == 0x00)
				&& (hcSentence[hcSentenceLength - 1] == 0xfe)) {
			hcSentenceLength = 0;
			hcSentence[hcSentenceLength++] = 0x00;
			hcSentence[hcSentenceLength++] = 0xfe;
			hcSentence[hcSentenceLength++] = hcRxChar[0];
			hcSentenceReady = 0;
		} else if ((hcSentenceLength > 3) && (hcRxChar[0] == '\0')
				&& (hcSentence[hcSentenceLength - 1] == 0xff)
				&& (hcSentence[hcSentenceLength - 2] == 0x00)) {
			hcSentence[hcSentenceLength++] = hcRxChar[0];
			hcSentenceReady = 1;
		} else {
			hcSentence[hcSentenceLength++] = hcRxChar[0];
		}

		HAL_UART_Receive_IT(&huart8, hcRxChar, 1);
	}
	if (huart == &huart7) {
		// WiFi - Esp32

		Esp32_Sentence_length = Esp32_Sentence_length % ESP32SENTENCE;
		// begin: {"Id":
		if ((esp32RxChar[0] == ':') && (Esp32_Sentence_length >= 5)
				&& (Esp32_Sentence[Esp32_Sentence_length - 1] == '"')
				&& (Esp32_Sentence[Esp32_Sentence_length - 2] == 'd')
				&& (Esp32_Sentence[Esp32_Sentence_length - 3] == 'I')
				&& (Esp32_Sentence[Esp32_Sentence_length - 4] == '"')
				&& (Esp32_Sentence[Esp32_Sentence_length - 5] == '{')) {
			Esp32_Sentence_length = 0;
			esp32SentenceReady = 0;
			Esp32_Sentence[Esp32_Sentence_length++] = '{';
			Esp32_Sentence[Esp32_Sentence_length++] = '"';
			Esp32_Sentence[Esp32_Sentence_length++] = 'I';
			Esp32_Sentence[Esp32_Sentence_length++] = 'd';
			Esp32_Sentence[Esp32_Sentence_length++] = '"';
			Esp32_Sentence[Esp32_Sentence_length++] = esp32RxChar[0];
		} else if ((esp32RxChar[0] == '}') && (Esp32_Sentence_length >= 2)
				&& (Esp32_Sentence[Esp32_Sentence_length - 1] == '}')
				&& (Esp32_Sentence[Esp32_Sentence_length - 2] == '}')) {
			Esp32_Sentence[Esp32_Sentence_length++] = '}';
			Esp32_Sentence[Esp32_Sentence_length++] = '\n';
			Esp32_Sentence[Esp32_Sentence_length++] = '\r';
			Esp32_Sentence[Esp32_Sentence_length++] = '\0';
			esp32SentenceReady = 1;

		} else {
			Esp32_Sentence[Esp32_Sentence_length++] = esp32RxChar[0];
		}


		HAL_UART_Receive_IT(&huart7, esp32RxChar, 1);
	}
}

void vypis(char str[]) {
	HAL_UART_Transmit(&huart2, (uint8_t*) str, strlen(str), 200);
}

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	//MX_CAN1_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_SPI2_Init();
	MX_SPI3_Init();
	MX_SPI4_Init();
	MX_UART7_Init();
	MX_UART8_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_USART3_UART_Init();
	MX_TIM1_Init();
	/* USER CODE BEGIN 2 */

	HAL_TIM_Base_Start_IT(&htim1);
	
	if (HAL_UART_Receive_IT(&huart8, hcRxChar, 1) != HAL_OK) {
		vypis("Error: HC-12\r\n");
	}

	if (HAL_UART_Receive_IT(&huart7, esp32RxChar, 1) != HAL_OK) {
		vypis("Error: Esp32\r\n");
	}

	/*
	 * 				  RX - TX
	 * USART 1 - GPS - PA10, PA9
	 * GPS: 9600 Baud, 8 bits, no parity bit, 1 stop bit,
	 *
	 * USART 2 - SERIAL USB - PA3, PA2
	 * USART 3 - MICROBUS CLICK2 - PD9, PD8 + PD11 + PD12
	 * UART 7 - ESP32 - PE7, PE8
	 * UART 8 - HC-12 - PE0, PE1, PC3 (set)
	 * SET PIN = low (reset) -> setting mode, AT
	 * SET PIN = high (set) -> communication mode
	 *
	 * SPI4 - LORA - PE2 - PE6
	 * USART3
	 *
	 * I2C2 - GPS
	 *
	 */

	// set HC-12 to normal mode
	HAL_GPIO_WritePin(HC_SET_GPIO_Port, HC_SET_Pin, GPIO_PIN_SET); // HC-12 transcieve mode
	HAL_Delay(50);
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {

		if (esp32SentenceReady == 1) {
			HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
			vypis(Esp32_Sentence);
			esp32SentenceReady = 0;
			Esp32_Sentence_length = 0;
		}

		if (hcSentenceReady == 1) {
			parseMessage(&hcSentence, &hcSentenceLength);
			hcSentenceLength = 0;
			hcSentenceReady = 0;
			HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
		}

		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

	}
	/* USER CODE END 3 */

}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE()
	;

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = 8;
	RCC_OscInitStruct.PLL.PLLN = 180;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Activate the Over-Drive mode
	 */
	if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* CAN1 init function */
static void MX_CAN1_Init(void) {

	hcan1.Instance = CAN1;
	hcan1.Init.Prescaler = 16;
	hcan1.Init.Mode = CAN_MODE_NORMAL;
	hcan1.Init.SyncJumpWidth = CAN_SJW_1TQ;
	hcan1.Init.TimeSeg1 = CAN_BS1_1TQ;
	hcan1.Init.TimeSeg2 = CAN_BS2_1TQ;
	hcan1.Init.TimeTriggeredMode = DISABLE;
	hcan1.Init.AutoBusOff = DISABLE;
	hcan1.Init.AutoWakeUp = DISABLE;
	hcan1.Init.AutoRetransmission = DISABLE;
	hcan1.Init.ReceiveFifoLocked = DISABLE;
	hcan1.Init.TransmitFifoPriority = DISABLE;
	if (HAL_CAN_Init(&hcan1) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

